{"basics":{"name":"Michael (Jiahe) Pan","role":"MSc. student in Robotics, Systems and Control at ETH Zürich","image":"","email":"jiapan@student.ethz.ch","homepage":"https://mpan31415.github.io/","intro":"I am passionate about achieving physical robotic intelligence through novel learning paradigms and real-world interaction.","location":{"address":"Sonneggstrasse 17","postalCode":"8006 Zürich","city":"Zürich","countryCode":"CH","region":"Zürich"}},"work":[{"name":"Monash Robotics Lab, Monash University","position":"Research Assistant","startDate":"2023-02-01","endDate":"2023-06-08","summary":"Supervisor: Prof. Akansel Cosgun","highlights":["Developed a novel motion planning framework for integrated grasp selection and trajectory optimization for robotic arms operating in cluttered environments.","Combined Bayesian optimization for grasp selection, sampling-based trajectory initialization (RRT-Connect), and receding-horizon SQP optimization with constraint-tightening; evaluated performance in simulation (Gazebo) and on the Fetch robot hardware."]},{"name":"Computational HRI Lab (CHRI), University of Melbourne","position":"Research Assistant","startDate":"2024-01-01","endDate":"2024-07-30","summary":"Supervisors: Dr. Jonathan Eden, Prof. Wafa Johal, Prof. Denny Oetomo","highlights":["Conducted research in shared autonomy, human-robot interaction, and teleoperation, including modeling user performance with Fitts' Law, analyzing cognitive load and trust in shared control, and developing systems for robot teleoperation using haptic and motion capture interfaces.","Implemented shared control policies, autonomous navigation, visual perception, natural language interaction, and mobile manipulation (TIAGo); developed custom controllers, trajectory generation pipelines, and human-robot interfaces using haptic devices and AR."]},{"name":"Robotics and Perception Group (RPG), The University of Zürich","position":"Graduate Student Researcher","startDate":"2025-03-17","endDate":"2025-07-31","summary":"Supervisor: Prof. Davide Scaramuzza","highlights":["Working on data-driven differentiable simulation for learning agile and real-time adaptive quadrotor control in scenarios with complex and time-varying aerodynamics."]},{"name":"Berkeley AI Research (BAIR), UC Berkeley","position":"Visiting Student Researcher","startDate":"2025-09-15","endDate":"2026-04-17","summary":"Supervisors: Prof. Jitendra Malik (UC Berkeley), Prof. Stelian Coros (ETH Zürich)","highlights":["Working on robot manipulation and whole-body control, with a focus on learning dexterous and agile low-level skills from a mixture of real-world and simulator data."]}],"education":[{"institution":"ETH Zürich","location":"Zürich, Switzerland","url":"https://ethz.ch/en.html","area":"Robotics, Systems and Control","studyType":"Master of Science","startDate":"2024-09-17","endDate":"2026-08-30","score":"10","courses":["Current GPA: 5.85/6.0","Reinforcement learning, Deep learning, Probabilistic AI, Computer vision, Motion planning, Computational motion modeling, Distributed control, Dynamic programming, Robot dynamics","Thesis Supervisors: Prof. Jitendra Malik (UC Berkeley), Prof. Stelian Coros (ETH Zürich)"]},{"institution":"University of Melbourne","location":"Melbourne, Australia","url":"https://www.unimelb.edu.au/","area":"Mechatronics Engineering","studyType":"Bachelor of Science","startDate":"2021-03-01","endDate":"2023-11-30","score":"10","courses":["Grade: 87.7/100 (First Class Honors)","Dean's Honors List 2023 (top 3% of all BSc students)","System modeling, analysis and control; Mechanical and electronics; Machine learning and AI"]}],"awards":[{"title":"Best Project Award for the Probabilistic AI course (Prof. Andreas Krause)","date":"2024-12-18","awarder":"ETH Zürich","url":"https://las.inf.ethz.ch/teaching/pai-f24","summary":"The task involved Gaussian Process regression for air pollution prediction, and the student's innovative solution addressed several issues such as scaling/computational cost and hyperparameter selection. The student's team was selected as best among 297 teams."},{"title":"1st-place in the Office Assistant Robot Competition at HRI'24 (Boulder, Colorado)","date":"2024-03-15","awarder":"The 20th IEEE/ACM International Conference on Human-Robot Interaction","url":"https://hri2024c.web.app/hri2014rc3.html","summary":"Develop social robot applications designed to provide invaluable assistance and companionship to workers in the office environment. The competition serves as a platform for participants to demonstrate the capabilities of their social robots and to highlight the ways in which these intelligent machines can enhance the productivity and well-being of office professionals."},{"title":"The University of Melbourne Dean's Honors List","date":"2023-12-06","awarder":"University of Melbourne","url":"https://science.unimelb.edu.au/students/scholarships/deans-honours-list-2024#dean-s-honours-list-2023","summary":"The Dean's Honors List acknowledges the outstanding dedication and capabilities of the top-performing students within the Faculty of Science. Awarded to undergraduate students ranked in the top 3% of their year level within their course."},{"title":"Summer Research Scholarship","date":"2022-11-10","awarder":"Monash University","url":"https://www.monash.edu/engineering/current-students/graduate-research/summer-research-program-scholarships","summary":"For 10 weeks over the summer break, participants are paid a $6000 scholarship to work on a research project under the supervision of a Monash University academic."},{"title":"U21 Global Citizens","date":"2022-06-30","awarder":"Common Purpose","url":"https://universitas21.com/opportunities/for-students/globalcitizens/","summary":"By developing ideas together, across borders and time zones, students develop the skills needed to thrive in the 21st century whilst tackling some of the world's most pressing problems, outlined in the United Nation Sustainable Development Goals (UNSDG)."}],"skills":[{"name":"Research Skills","level":"Master","icon":"fa-solid fa-hashtag","keywords":["- Hands-on experience with robotic platforms: Franka Panda, Fetch, TIAGo, Furhat, UR3, quadrotors.","- Theoretical and hands-on experience with reinforcement learning, imitation learning, motion planning & trajectory optimization, neural representations (NeRF), and policy learning in differentiable simulation.","- Independent and collaborative research project management, experimental design and implementation, data collection (simulation & real-world) and statistical analysis.","- Peer-reviewing for paper submissions (HRI'25)."]},{"name":"Software Skills","level":"Master","icon":"fa-solid fa-hashtag","keywords":["- Python, C++, C, R, MATLAB; Linux (Ubuntu), PyTorch, JAX, Git, Docker, Conda","- ROS, ROS2, IsaacGym, MuJoCo, Gazebo; MoveIt!, ROS Nav, TrajOpt, cvxpy, CasADi."]},{"name":"Hardware Skills","level":"Master","icon":"fa-solid fa-hashtag","keywords":["- G.tec EEG recording with 32-channel setup using dry electrodes on an EEG cap.","- Basic understanding of Unity, Hololens 2, Meta Quest 2, OptiTrack motion-capture systems."]}],"languages":[{"language":"Chinese","fluency":"Native speaker","icon":""},{"language":"English","fluency":"Full proficiency","icon":""}]}