{
  "basics": {
    "name": "Michael (Jiahe) Pan",
    "role": "MSc. student in Robotics, Systems and Control at ETH Zürich",
    "image": "",
    "email": "michael.pan31415@gmail.com",
    "homepage": "https://mpan31415.github.io/",
    "intro": "I am passionate about achieving physical robotic intelligence through novel learning paradigms and real-world interaction, especially in contact-rich tasks involving dexterous manipulation.",
    "location": {
      "address": "Sonneggstrasse 17",
      "postalCode": "8006 Zürich",
      "city": "Zürich",
      "countryCode": "CH",
      "region": "Zürich"
    }
  },
  "work": [
    {
      "name": "Monash Robotics Lab, Monash University",
      "position": "Research Assistant",
      "startDate": "2023-02-01",
      "endDate": "2023-06-08",
      "summary": "Designed and implemented a novel motion planning algorithm for integrated grasp selection and trajectory optimization for robotic arms in cluttered workspaces. The algorithm incorporate three key ideas:",
      "highlights": [
        "Parametric grasp selection using Bayesian optimization.",
        "Trajectory initialization using sampling-based planning (RRT-Connect).",
        "Trust-region SQP trajectory optimization in a receding-horizon style with gradual constraint-tightening for enhanced computational efficiency."
      ]
    },
    {
      "name": "Human-Robotics Lab, University of Melbourne",
      "position": "Research Assistant",
      "startDate": "2024-01-01",
      "endDate": "2024-07-30",
      "summary": "Led various robotics research projects ranging from adaptive autonomy in human-robot shared control to designing and implementing an office assistant robot.",
      "highlights": [
        "Modeling performance in human-robot shared control using Fitts' Law. Designed and implemented tracking and convex-blending controllers for a target-reaching task.",
        "Studied the effects of shared control on a human teleoperator's cognitive load and trust. Designed and implemented a trajectory-tracking task with a haptic controller interface.",
        "Explored using a robot (Furhat) for affective visualization of complex real-world data.",
        "Designed an office assistant robot (TIAGo), implementing autonomous navigation, person-tracking and following, natural language conversation and understanding, object detection and manipulation with arm trajectory control.",
        "Investigated motion-capture-based robot teleoperation using augmented-reality to enhance performance and user perception. Implemented trajectory mapping and generation."
      ]
    },
    {
      "name": "Robotics and Perception Group, University of Zürich",
      "position": "Thesis Student",
      "startDate": "2025-03-17",
      "endDate": "2025-07-31",
      "summary": "Working on data-driven differentiable simulation for learning quadrotor control in scenarios with complex aerodynamics.",
      "highlights": [
        "In progress ..."
      ]
    }
  ],
  "education": [
    {
      "institution": "ETH Zürich",
      "location": "Zürich, Switzerland",
      "url": "https://ethz.ch/en.html",
      "area": "Robotics, Systems and Control",
      "studyType": "Master of Science",
      "startDate": "2024-09-17",
      "endDate": "2026-06-30",
      "score": "10",
      "courses": [
        "Reinforcement learning, Robot dynamics, Deep learning, Probabilistic AI, Computer vision, Motion planning, Dynamic programming, Distributed control, Computational motion modeling",
        "Tutor: Prof. Robert Riener (Sensory-Motor Systems Lab)"
      ]
    },
    {
      "institution": "University of Melbourne",
      "location": "Melbourne, Australia",
      "url": "https://www.unimelb.edu.au/",
      "area": "Mechatronics Engineering",
      "studyType": "Bachelor of Science",
      "startDate": "2021-03-01",
      "endDate": "2023-11-30",
      "score": "10",
      "courses": [
        "System modeling, analysis and control; Mechanical and electronics; Machine learning and AI",
        "Grade: 87.7/100 (First Class Honors)",
        "Dean's Honors List 2023 (top 3% of all BSc students)",
        "Thesis supervisors: Dr. Jonathan Eden, Prof. Wafa Johal, Prof. Denny Oetomo"
      ]
    }
  ],
  "awards": [
    {
      "title": "1st-place in the Office Assistant Robot Competition at HRI'24 (Boulder, Colorado)",
      "date": "2024-03-15",
      "awarder": "The 20th IEEE/ACM International Conference on Human-Robot Interaction",
      "url": "https://hri2024c.web.app/hri2014rc3.html",
      "summary": "Develop social robot applications designed to provide invaluable assistance and companionship to workers in the office environment. The competition serves as a platform for participants to demonstrate the capabilities of their social robots and to highlight the ways in which these intelligent machines can enhance the productivity and well-being of office professionals."
    },
    {
      "title": "The University of Melbourne Dean's Honors List",
      "date": "2023-12-06",
      "awarder": "University of Melbourne",
      "url": "https://science.unimelb.edu.au/students/scholarships/deans-honours-list-2024#dean-s-honours-list-2023",
      "summary": "The Dean's Honors List acknowledges the outstanding dedication and capabilities of the top-performing students within the Faculty of Science. Awarded to undergraduate students ranked in the top 3% of their year level within their course."
    },
    {
      "title": "Summer Research Scholarship",
      "date": "2022-11-10",
      "awarder": "Monash University",
      "url": "https://www.monash.edu/engineering/current-students/graduate-research/summer-research-program-scholarships",
      "summary": "For 10 weeks over the summer break, participants are paid a $6000 scholarship to work on a research project under the supervision of a Monash University academic."
    },
    {
      "title": "U21 Global Citizens",
      "date": "2022-06-30",
      "awarder": "Common Purpose",
      "url": "https://universitas21.com/opportunities/for-students/globalcitizens/",
      "summary": "By developing ideas together, across borders and time zones, students develop the skills needed to thrive in the 21st century whilst tackling some of the world's most pressing problems, outlined in the United Nation Sustainable Development Goals (UNSDG)."
    }
  ],
  "skills": [
    {
      "name": "Research Skills",
      "level": "Master",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "- Experience working with real robotic platforms (Franka Panda, Fetch, TIAGo, Furhat, UR3)",
        "- Knowledge of optimization and sampling-based planners for motion planning and trajectory optimization. Understandings of reinforcement learning, imitation learning, and learning from demonstration",
        "- Understanding of clearly defining research questions, developing methods for evaluation, and publishing as first author and co-author in both independent and collaborative research projects",
        "- Proficient in designing and conducting experimental validations and user studies, collecting data through physiological measures, questionnaires, and interviews, and performing statistical analysis using hypothesis tests and mixed models",
        "- Providing detailed peer-reviews for paper submissions"
      ]
    },
    {
      "name": "Software Skills",
      "level": "Master",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "- Proficient in Python, C++, C, R, MATLAB",
        "- Familiar with Linux (Ubuntu), PyTorch, Git, Docker, Conda",
        "- Proficient in ROS, ROS2, RViz, Gazebo; Theoretical understanding of differentiable physics simulators",
        "- Familiar with motion planning libraries (MoveIt!, ROS Navigation, Tesseract ROS TrajOpt)"
      ]
    },
    {
      "name": "Hardware Skills",
      "level": "Master",
      "icon": "fa-solid fa-hashtag",
      "keywords": [
        "- G.tec EEG recording with 32-channel setup using dry electrodes on an EEG cap",
        "- Basic understanding of Unity, Hololens 2, Meta Quest 2, OptiTrack motion-capture system"
      ]
    }
  ],
  "languages": [
    {
      "language": "Chinese",
      "fluency": "Native speaker",
      "icon": ""
    },
    {
      "language": "English",
      "fluency": "Full proficiency",
      "icon": ""
    }
  ]
}
